In [4]:
try:
    file=open('panads.csv','x')
    file.close()
except:
    print("The file is already there.")

In [1]:
import pandas as pd
df = pd.read_csv('panads.csv')
print(df)

   sn    name  age        add       phone
0   1  dambar   22    dailekh  9868927014
1   2     ram   44    surkhet  9878945678
2   3   shyam   34  kathmandu  9878988888
3   4    hari   56     butwal  6666666666
4   5  pramod   29   bhaktpur  3333333333
5   6  resham   44   lalitpur  4444444444

In [10]:
df.head(4)

   sn    name  age        add       phone
0   1  dambar   22    dailekh  9868927014
1   2     ram   44    surkhet  9878945678
2   3   shyam   34  kathmandu  9878988888
3   4    hari   56     butwal  6666666666

In [11]:
df.tail(4)

   sn    name  age        add       phone
2   3   shyam   34  kathmandu  9878988888
3   4    hari   56     butwal  6666666666
4   5  pramod   29   bhaktpur  3333333333
5   6  resham   44   lalitpur  4444444444

In [14]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn', usecols=['sn', 'name','age'])
df

      name  age
sn
1   dambar   22
2      ram   44
3    shyam   34
4     hari   56
5   pramod   29
6   resham   44

In [17]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn')
df.iloc[0:3,1:3]

    age        add
sn
1    22    dailekh
2    44    surkhet
3    34  kathmandu

In [18]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn')
df.loc[2:5]

      name  age        add       phone
sn
2      ram   44    surkhet  9878945678
3    shyam   34  kathmandu  9878988888
4     hari   56     butwal  6666666666
5   pramod   29   bhaktpur  3333333333

In [19]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='name')
df.loc["ram":"pramod"]

        sn  age        add       phone
name
ram      2   44    surkhet  9878945678
shyam    3   34  kathmandu  9878988888
hari     4   56     butwal  6666666666
pramod   5   29   bhaktpur  3333333333

In [20]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn')
df['add']

sn
1      dailekh
2      surkhet
3    kathmandu
4       butwal
5     bhaktpur
6     lalitpur
Name: add, dtype: object

In [2]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn')
df['add']=="kathmandu"

sn
1    False
2    False
3     True
4    False
5    False
6    False
Name: add, dtype: bool

In [3]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn')
df[df['add']=="kathmandu"]

     name  age        add       phone
sn
3   shyam   34  kathmandu  9878988888

In [4]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn')
df[(df['add']=="kathmandu")&(df['phone']==4444444444)]

Empty DataFrame
Columns: [name, age, add, phone]
Index: []

In [6]:
import pandas as pd
df = pd.read_csv('panads.csv', index_col='sn')
df[(df['add']=="kathmandu")|(df['phone']==4444444444)]

      name  age        add       phone
sn
3    shyam   34  kathmandu  9878988888
6   resham   44   lalitpur  4444444444

In [5]:
import pandas as pd
data={'name':['ram','shyam','hari'],
     'age':[34,65,78],
     'address':['kathmandu','surkhet','butwal']}
df=pd.DataFrame(data)
df.to_csv('panads.csv')
df

    name  age    address
0    ram   34  kathmandu
1  shyam   65    surkhet
2   hari   78     butwal

In [6]:
df=pd.read_csv('panads.csv', index_col='sn')
df

     name  age    address
sn
0     ram   34  kathmandu
1   shyam   65    surkhet
2    hari   78     butwal

In [10]:
import csv
data=['sn', 'ramesh',45, 'kathmandu']
file=open('panads.csv','w')
x= csv.writer(file)
x.writerow(data)
file.close()

In [ ]:
import csv
data=[1, 'ramesh',45, 'kathmandu']
file=open('panads.csv','w')
x= csv.writer(file)
x.writerow(data)
file.close()

In [15]:
import csv
data=[['1', 'ramesh',45, 'kathmandu'],
      [2,'pawan',43,'surkhet'],
     [3,'surya',22,'bhaktpur']]
file=open('panads.csv','w')
x= csv.writer(file)
for i in data:
    x.writerow(i)
file.close()

In [23]:
import csv
csv_columns=['name','age','address']
dict=[
    {'name':'ramesh', 'age':34,'address':'dailekh'},
    {'name':'rohit', 'age':25,'address':'bardiya'}
]
csvfile=open('panads.csv','w')
writer=csv.DictWriter(csvfile, fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)
csvfile.close()

In [1]:
import csv
with open('panads.csv') as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
        print(dict(row))

{'name': 'ramesh', 'age': '34', 'address': 'dailekh'}
{'name': 'rohit', 'age': '25', 'address': 'bardiya'}

In [2]:
import csv
csvfile= open('panads.csv')
reader=csv.DictReader(csvfile)
for row in reader:
    print(dict(row))

{'name': 'ramesh', 'age': '34', 'address': 'dailekh'}
{'name': 'rohit', 'age': '25', 'address': 'bardiya'}

In [10]:
import pandas as pd
df=pd.read_csv('panads.csv', index_col='name')
df.drop(['ram'],axis=0)

       Unnamed: 0  age  address
name
shyam           1   65  surkhet
hari            2   78   butwal

In [4]:
import pandas as pd
dict1={
    "name":["ram","hari","shyam","Pramod"],
    "marks":[22,24,26,32],
    "address":["butwal","surkhet","dailekh","dang"]
}
df=pd.DataFrame(dict1)
df

     name  marks  address
0     ram     22   butwal
1    hari     24  surkhet
2   shyam     26  dailekh
3  Pramod     32     dang

NameError: name 'pd' is not defined